---
title: StructuralConnectionApprovalType
classe: Autodesk.Revit.DB.Structure.StructuralConnectionApprovalType
namespace: Autodesk.Revit.DB.Structure
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# StructuralConnectionApprovalType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `StructuralConnectionApprovalType Create(Document, String)` | `StructuralConnectionApprovalType.Create(doc, name)` | StructuralConnectionApprovalType |
| `Void GetAllStructuralConnectionApprovalTypes(Document, ICollection<ElementId>&)` | `StructuralConnectionApprovalType.GetAllStructuralConnectionApprovalTypes(cda, ids)` | Void |
| `Boolean IsValidApprovalTypeName(Document, String)` | `StructuralConnectionApprovalType.IsValidApprovalTypeName(doc, name)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```